3A/PHYS234/Operators-and-Measurement.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-13 Wed 17:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Operators and Measurement</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Operators and Measurement</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org296494b">1. Operators, Eigenvalues, and Eigenvectors</a>
<ul>
<li><a href="#org5dbcd57">1.1. Matrix Representation of Operators</a></li>
</ul>
</li>
<li><a href="#org6e06063">2. New Operators</a>
<ul>
<li><a href="#orgfa19c32">2.1. Hermetian Operators</a></li>
<li><a href="#org53ee75a">2.2. Projection Operators</a></li>
</ul>
</li>
<li><a href="#org0a4eb71">3. Measurement</a></li>
<li><a href="#org6802b9a">4. Commuting Observables</a></li>
<li><a href="#org24e1269">5. Uncertainty Principle</a></li>
</ul>
</div>
</div>
<div id="outline-container-org296494b" class="outline-2">
<h2 id="org296494b"><span class="section-number-2">1.</span> Operators, Eigenvalues, and Eigenvectors</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Operator</b>: mathematical object that acts on a ket and transforms it into a new ket
</p>

<p>
<b>Postulate 2</b>: a physical observable is represented mathematically by an operator \(A\)
that acts on a ket
</p>

<p>
<b>Postulate 3</b>: the only possible result of a measurement of an observable is one of
the eigenvalues \(a_{n}\) of the corresponding operator \(A\)
</p>

<p>
An operator is always diagonal in its own basis.
Eigenvectors are unit vectors in their own basis.
</p>
</div>
<div id="outline-container-org5dbcd57" class="outline-3">
<h3 id="org5dbcd57"><span class="section-number-3">1.1.</span> Matrix Representation of Operators</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Each matrix element can be found as a bra multiplied by an operator multiplied by
a ket.
</p>
</div>
</div>
</div>
<div id="outline-container-org6e06063" class="outline-2">
<h2 id="org6e06063"><span class="section-number-2">2.</span> New Operators</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfa19c32" class="outline-3">
<h3 id="orgfa19c32"><span class="section-number-3">2.1.</span> Hermetian Operators</h3>
<div class="outline-text-3" id="text-2-1">
<p>
An operator \(A\) is Hermetian if it is equal to its Hermetian adjoint.
</p>
</div>
</div>
<div id="outline-container-org53ee75a" class="outline-3">
<h3 id="org53ee75a"><span class="section-number-3">2.2.</span> Projection Operators</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Closure/Completeness</b>: the sum of the projector operators for all eigenstates is the identity operator.
</p>

<p>
When a projector operator for an eigenstate acts on a state, it produces a new ket that is aligned
along the eigenstate and has a magnitude equal to the amplitude (including the phase) for the
state to be in that eigenstate.
</p>

<p>
<b>Postulate 5</b>: after a measurement of \(A\) that yields the result \(a_{n}\), the quantum system
is in a new state that is the normalized projection of the original system ket onto the
ket or kets corresponding to the result of the measurement, giving
\[
        \ket{\psi '} = \frac{P_{n} \ket{\psi}}{\sqrt{\bra{\psi} P_{n} \ket{\psi}}}
\]
</p>

<p>
Quantum measurements cannot be made without disturbing the system (except where input and
output are the same), this leads to collapse.
</p>
</div>
</div>
</div>
<div id="outline-container-org0a4eb71" class="outline-2">
<h2 id="org0a4eb71"><span class="section-number-2">3.</span> Measurement</h2>
<div class="outline-text-2" id="text-3">
<p>
The mean (expected value) measurement for an operator \(A\) on a state \(\ket{\psi}\) is
\[
        \left< A \right> = \bra{\psi} A \ket{\psi} = \sum_{n} a_{n} P_{a_{n}}
\]
</p>

<p>
The standard deviation is defined as:
\[
        \Delta A = \sqrt{\left< (A - \left< A \right>)^{2} \right>}
        = \sqrt{\left< A^{2} \right> - \left< A \right>^{2}}
\]
which is derived from root-mean-square.
</p>
</div>
</div>
<div id="outline-container-org6802b9a" class="outline-2">
<h2 id="org6802b9a"><span class="section-number-2">4.</span> Commuting Observables</h2>
<div class="outline-text-2" id="text-4">
<p>
The commutator of two operators is \([A, B] = AB - BA\).
</p>

<p>
If the commutator is 0, the operators commute.
</p>

<p>
Commuting operators share common eigenstates.
</p>

<p>
The commutation relations for the spin component operators are:
\[
[S_{x}, S_{y}] = i \hslash S_{z}, [S_{y}, S_{z}] = i \hslash S_{x}, [S_{z}, S_{x}] = i \hslash S_{y}
\]
</p>
</div>
</div>
<div id="outline-container-org24e1269" class="outline-2">
<h2 id="org24e1269"><span class="section-number-2">5.</span> Uncertainty Principle</h2>
<div class="outline-text-2" id="text-5">
<p>
\[
\Delta A \Delta B \ge \frac{1}{2} \left| \left< \left[A, B\right] \right> \right|
\]
</p>

<p>
One spin component can be known absolutely but not 2 or simultaneously.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-13 Wed 17:08</p>
</div>
</body>
</html>
